In [ ]:
!pip3 install matplotlib pandas numpy mysql-connector-python-rf

In [1]:
import os
import pandas as pd
import mysql.connector

In [2]:
username = os.environ.get('DB_USER')
password = os.environ.get('DB_PASS')

In [3]:
connection = mysql.connector.connect(host='localhost', user=username, passwd=password, db='employees',auth_plugin='mysql_native_password')
connection

In [4]:
source_table = pd.read_sql('SHOW Tables FROM employees', connection)
source_table
for row in source_table['Tables_in_employees']:
    table_name = row.decode()
    details = pd.read_sql('desc {}'.format(table_name),connection)
    print(table_name, '=========================','\n', details, '\n', '\n')

current_dept_emp =========================
        Field        Type Null Key Default Extra
0     emp_no      b'int'   NO  []    None
1    dept_no  b'char(4)'   NO  []    None
2  from_date     b'date'  YES  []    None
3    to_date     b'date'  YES  []    None


departments =========================
        Field            Type Null           Key Default Extra
0    dept_no      b'char(4)'   NO  [80, 82, 73]    None
1  dept_name  b'varchar(40)'   NO  [85, 78, 73]    None


dept_emp =========================
        Field        Type Null           Key Default Extra
0     emp_no      b'int'   NO  [80, 82, 73]    None
1    dept_no  b'char(4)'   NO  [80, 82, 73]    None
2  from_date     b'date'   NO            []    None
3    to_date     b'date'   NO            []    None


dept_emp_latest_date =========================
        Field     Type Null Key Default Extra
0     emp_no   b'int'   NO  []    None
1  from_date  b'date'  YES  []    None
2    to_date  b'date'  YES  []    None


dept_manager =========================
        Field        Type Null           Key Default Extra
0     emp_no      b'int'   NO  [80, 82, 73]    None
1    dept_no  b'char(4)'   NO  [80, 82, 73]    None
2  from_date     b'date'   NO            []    None
3    to_date     b'date'   NO            []    None


employees =========================
         Field              Type Null           Key Default Extra
0      emp_no            b'int'   NO  [80, 82, 73]    None
1  birth_date           b'date'   NO            []    None
2  first_name    b'varchar(14)'   NO            []    None
3   last_name    b'varchar(16)'   NO            []    None
4      gender  b"enum('M','F')"   NO            []    None
5   hire_date           b'date'   NO            []    None


salaries =========================
        Field     Type Null           Key Default Extra
0     emp_no   b'int'   NO  [80, 82, 73]    None
1     salary   b'int'   NO            []    None
2  from_date  b'date'   NO  [80, 82, 73]    None
3    to_date  b'date'   NO            []    None


titles =========================
        Field            Type Null           Key Default Extra
0     emp_no          b'int'   NO  [80, 82, 73]    None
1      title  b'varchar(50)'   NO  [80, 82, 73]    None
2  from_date         b'date'   NO  [80, 82, 73]    None
3    to_date         b'date'  YES            []    None

In [5]:
titles = pd.read_sql('select title, first_name, last_name, gender, salary, hire_date FROM titles t \
left join employees as e on t.emp_no \
left join salaries as s on t.emp_no = s.emp_no limit 100', connection).head()
titles

                title first_name       last_name gender  salary   hire_date
0  Assistant Engineer  Jaroslava  Camarinopoulos      F   60929  1987-02-25
1  Assistant Engineer       Arne         Kolinko      F   60929  1988-12-20
2  Assistant Engineer    Gennadi         Sigstam      F   60929  1989-03-22
3  Assistant Engineer   Thodoros          Cooley      M   60929  1987-06-14
4  Assistant Engineer   Hercules      Castellani      M   60929  1988-09-11